MrBurgy/hardware-firmware-stm32-st7783/blinky_uart/src/main.c
/* Example how to use GPIO Port and UART
 *
 * Desktop PC Terminal configuration:
 * 	19200 Baud
 * 	7 Data Bits
 * 	1 Stop Bit
 * 	Parity Odd
 * 	HwFlowCtl None
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "BlinkLed.h"
#include "stm32f4xx_hal_conf.h"
#include "stm32f4xx_hal.h"



// ----- main() ---------------------------------------------------------------

// Sample pragmas to cope with warnings. Please note the related line at
// the end of this function, used to pop the compiler diagnostics status.
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wmissing-declarations"
#pragma GCC diagnostic ignored "-Wreturn-type"


UART_HandleTypeDef UartHandle;

/**
  * @brief  This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
void SysTick_Handler(void)
{
  HAL_IncTick();
}

void initButton1(void)
{
	// Enable GPIO Peripheral clock
	  //RCC->AHB1ENR |= GPIO_PIN_13;

	__GPIOC_CLK_ENABLE();

	  GPIO_InitTypeDef GPIO_InitStructure;

	  // Configure pin in output push/pull mode
	  GPIO_InitStructure.Pin = GPIO_PIN_All;
	  GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
	  GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
	  GPIO_InitStructure.Pull = GPIO_PULLDOWN;
	  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);


}

int main(int argc, char* argv[])
{

	initButton1();

	UartHandle.State = HAL_UART_STATE_RESET;
	UartHandle.Instance        = USARTx;

	  UartHandle.Init.BaudRate   = 9600;
	  UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
	  UartHandle.Init.StopBits   = UART_STOPBITS_1;
	  UartHandle.Init.Parity     = UART_PARITY_ODD;
	  UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
	  UartHandle.Init.Mode       = UART_MODE_TX_RX;
	  HAL_UART_Init(&UartHandle);

	uint8_t str[30] = "Hallo\n\r";

	HAL_UART_Transmit(&UartHandle, str, 7, 0xFFFF);

  blink_led_init();

  uint8_t n = 0;

  // Infinite loop
  while (1)
    {
      //blink_led_on();
      GPIOA->ODR = 1 << n;
      n = (n + 1) % 8;
      //blink_led_off();
      HAL_Delay(500);
      char strc[30] = { 0 };
      sprintf(strc, "%d;", n);
      HAL_UART_Transmit(&UartHandle, strc, strlen(strc), 0xFFFF);
    }
  // Infinite loop, never return.
}

void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* Enable GPIO TX/RX clock */
  USARTx_TX_GPIO_CLK_ENABLE();
  USARTx_RX_GPIO_CLK_ENABLE();

  /* Enable USARTx clock */
  USARTx_CLK_ENABLE();

  /*##-2- Configure peripheral GPIO ##########################################*/
  /* UART TX GPIO pin configuration  */
  GPIO_InitStruct.Pin       = USARTx_TX_PIN;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
  GPIO_InitStruct.Alternate = USARTx_TX_AF;

  HAL_GPIO_Init(USARTx_TX_GPIO_PORT, &GPIO_InitStruct);

  /* UART RX GPIO pin configuration  */
  GPIO_InitStruct.Pin = USARTx_RX_PIN;
  GPIO_InitStruct.Alternate = USARTx_RX_AF;

  HAL_GPIO_Init(USARTx_RX_GPIO_PORT, &GPIO_InitStruct);
}

/**
  * @brief UART MSP De-Initialization
  *        This function frees the hardware resources used in this example:
  *          - Disable the Peripheral's clock
  *          - Revert GPIO and NVIC configuration to their default state
  * @param huart: UART handle pointer
  * @retval None
  */
void HAL_UART_MspDeInit(UART_HandleTypeDef *huart)
{
  /*##-1- Reset peripherals ##################################################*/
  USARTx_FORCE_RESET();
  USARTx_RELEASE_RESET();

  /*##-2- Disable peripherals and GPIO Clocks #################################*/
  /* Configure UART Tx as alternate function  */
  HAL_GPIO_DeInit(USARTx_TX_GPIO_PORT, USARTx_TX_PIN);
  /* Configure UART Rx as alternate function  */
  HAL_GPIO_DeInit(USARTx_RX_GPIO_PORT, USARTx_RX_PIN);

}

#pragma GCC diagnostic pop

// ----------------------------------------------------------------------------
